{
    "fitc": [
        {
            "location": "Carmichael/Jackson",
            "time": " 11:00 - 11:45am",
            "date": "April 29 2014 ",
            "speaker": "Mikko Haapoja",
            "tags": "Web Dev, Creative Code, Business",
            "desc": "<p>During this talk Mikko will go over 2013 at Jam3: how the agency known for cool &ldquo;Flash&rdquo; work switched to do perhaps even cooler &ldquo;HTML/JS&rdquo; work without skipping a beat. He&rsquo;ll also review their approach to using a platform that was designed to show data to instead tell rich interactive stories. Lessons learned. Battles won. What&rsquo;s in store for 2014?</p><p>Attendees will walk away with technical tidbits/techniques, an understanding of the internal process at Jam3 and hopefully with some inspiration.</p>",
            "url": "http://fitc.ca/presentation/2013-mastering-new-things/",
            "title": "2013: Mastering New Things"
        },
        {
            "location": "The B-Side Room",
            "time": " 4:00 - 4:30pm",
            "date": "April 28 2014 ",
            "speaker": "Jonathan Moneta",
            "tags": "Hardware",
            "desc": "<p>&ldquo;Tea, Earl Grey, Hot&rdquo;: 3D printing promises Star-Trek like replication, but it&rsquo;s not quite there yet. In this practical talk, MAKELAB Creative Lead Jonathan Moneta shares the pains and gains of running large-scale interactive 3D printing events at museums and galleries, and explores the full gamut of printing from bleeding edge jaw-dropping uses of the technology, to the abilities of practical desktop units.You&rsquo;ll walk away from this talk understanding the different kinds of 3D printing technologies, which printer to get for your studio, how to talk competently about it, and where to get that thing you want printed right now.</p>",
            "url": "http://fitc.ca/presentation/3d-printing/",
            "title": "3D Printing Reality vs. Fantasy for Public Consumption"
        },
        {
            "location": "The B-Side Room",
            "time": " 12:00 - 12:30pm",
            "date": "April 29 2014 ",
            "speaker": "Anton Repponen",
            "tags": "Failure",
            "desc": "<p>Anton and Irene will candidly explain the 5 biggest failures and f*ck ups in their careers and evaluate why it went so horribly wrong.</p>",
            "url": "http://fitc.ca/presentation/5-biggest-failures-2/",
            "title": "5 Biggest Failures"
        },
        {
            "location": "Toronto II",
            "time": " 12:15 - 1:00pm",
            "date": "April 27 2014 ",
            "speaker": "Mike Butcher",
            "tags": "Web Dev",
            "desc": "<p><span>Our multi-device world is full of smartphones, smart TVs, smart refrigerators, tablets, laptops, dump phones and something called &ldquo;desktops&rdquo;&hellip; and all of them want our web content. Let&rsquo;s take a look in our toolbox to sort through the good, the bad and the completely impractical to find the best ways to deliver our stories to as wide an audience as possible. &nbsp;</span><span>This presentation is intended for those still trying to figure out what the difference is between &ldquo;adaptive&rdquo;, &ldquo;responsive&rdquo; and &ldquo;unified&rdquo; design, as well as those who are looking for new approaches for their content delivery.</span></p>",
            "url": "http://fitc.ca/presentation/adaptive-responsive-unification/",
            "title": "Adaptive, Responsive, Unified"
        },
        {
            "location": "Toronto III",
            "time": " 2:15 - 3:00pm",
            "date": "April 27 2014 ",
            "speaker": "Mary Franck",
            "tags": "Inspire, Creative Code",
            "desc": "<p>Media artist Mary Franck will discuss her practice of using realtime video and projection mapping for visceral experiences and storytelling, presenting recent projects to exemplify the relationships she creates between viewer, image, material and place.</p>",
            "url": "http://fitc.ca/presentation/aesthetics-of-an-abstract-machine-2/",
            "title": "Aesthetics of an Abstract Machine"
        },
        {
            "location": "The B-Side Room",
            "time": " 3:15 - 3:45pm",
            "date": "April 27 2014 ",
            "speaker": "Matthew Barnett",
            "tags": "Inspire, Storytelling",
            "desc": "<p>Brands are no longer limited to the traditional 30sec TV spot to get their story to an audience. The world of digital storytelling has not only opened the doors to long form, interactive pieces, it has also created an almost insatiable demand for content. So how can brands best utilize the ability to tell more in-depth stories, without succumbing to the pitfalls of an audience who has become more adverse to being &ldquo;advertised&rdquo; to? How can creatives produce more opportunities for high impact work, while budgets for digital are still well below that of traditional, televised content?</p>",
            "url": "http://fitc.ca/presentation/around-the-digital-campfire/",
            "title": "Around the Digital Campfire"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 2:15 - 3:00pm",
            "date": "April 27 2014 ",
            "speaker": "Charlie Taylor",
            "tags": "Inspire, Hardware",
            "desc": "<p>Both TV and the web overflow with brain scans, neural prostheses, brain medicines and brain drama. But most audiences have no idea how the brain works, and school biology has not kept pace. Enter Backyard Brains&hellip; conceived and shipped from a humble maker space in Ann Arbor, MI, their SpikerBoxes and mobile phone apps re-engineer complex and expensive university lab devices to demonstrate living neuron function in real time with inexpensive open technology.</p><p>The information unit of the nervous system is a &ldquo;spike&rdquo;, similar to a computer bit, but info is coded by timing and frequency of spikes (tiny electrical impulses lasting 1/1000 of a sec). The textbook description of spikes is often dull, but seeing and hearing spikes &ldquo;POP&rdquo; from a cockroach leg or human hand in real time is captivating. Backyard Brains&rsquo; compact and cheap devices spread neuronal excitement to young biologists and teachers.</p><p>These technologies side-step previous insurmountable equipment costs and technical SNAFUs to enable easy live classroom demonstrations. Smart phone cables and Apps provide a &ldquo;free&rdquo; oscilloscope display or very usable &ldquo;microscope.&rdquo; For college students, Backyard Brains provides a complete compact electrophysiology rig. All products are accompanied with online lesson plans and lab guides. The impact of these devices are apparent only with a live demonstration.</p>",
            "url": "http://fitc.ca/presentation/backyard-brains-neuroscience-up-close/",
            "title": "Backyard Brains – Neuroscience Up Close"
        },
        {
            "location": "Toronto I",
            "time": " 2:15 - 3:00pm",
            "date": "April 27 2014 ",
            "speaker": "Sara Blake",
            "tags": "Inspire",
            "desc": "<p>We are who we were as kids. I think it&rsquo;s that simple. The key is being brave and listening to that inner kid that&rsquo;s had all the answers all along. I&rsquo;ll cover my personal path with illustration, where I started, where I am now, and some things I&rsquo;ve learned along the way.</p>",
            "url": "http://fitc.ca/presentation/be-a-snortvart-2/",
            "title": "Be a Snortvart"
        },
        {
            "location": "Toronto I",
            "time": " 3:00 - 3:45pm",
            "date": "April 28 2014 ",
            "speaker": "Irene Pereyra",
            "tags": "Inspire, Business",
            "desc": "<p>Irene Pereyra, User Experience Director and Anton Repponen, Creative Director, will walk-through an in-depth &lsquo;behind the scenes&rsquo; of&nbsp;the redesign of&nbsp;<a href=\"http://www.wacom.com\" target=\"_blank\" title=\"Wacom.com\">Wacom.com</a>&nbsp;and the challenges in other large redesigns in a chronological manner: from how the projects started, to the successes and hurdles faced along the way, and ultimately to launch.</p><p>This incredibly candid presentation is an opportunity to learn about&nbsp;the ideas that worked and the others that failed miserably. It is&nbsp;the &lsquo;behind the scenes&rsquo; story of the real-life challenges faced by Anton and Irene, told in a refreshingly candid manner.</p>",
            "url": "http://fitc.ca/presentation/big-redesigns-tough-clients-and-a-lot-of-work-2/",
            "title": "Big Redesigns, Tough Clients and a Lot of Work!"
        },
        {
            "location": "Toronto I",
            "time": " 3:15 - 4:00pm",
            "date": "April 27 2014 ",
            "speaker": "Neil Mendoza",
            "tags": "Inspire, Creative Code",
            "desc": "<p>For the last few years, Neil has been using creative coding and electronics to bring digital creations into the physical world. This session looks at the creative process behind some of his work, the challenges that arose along the way and the lessons learned about how to connect with people by playing with technology.</p>",
            "url": "http://fitc.ca/presentation/breaking-the-frame-2/",
            "title": "Breaking the Frame"
        },
        {
            "location": "Toronto II",
            "time": " 3:00 - 3:45pm",
            "date": "April 28 2014 ",
            "speaker": "Vladimir Vukicevic",
            "tags": "Web Dev",
            "desc": "<p>In this presentation, Vladimir Vukicevic&nbsp;will introduce the Emscripten compiler and show how asm.js helps make the resulting JavaScript execute with near-native performance. &nbsp;He will go over the entire porting process for bringing new or existing C/C++ code to the web, and will also show some awesome demos of what has been done with these technologies in the game space.</p>",
            "url": "http://fitc.ca/presentation/bringing-cc-content-to-the-web-with-emscripten/",
            "title": "Bringing C/C++ Content to the Web with Emscripten"
        },
        {
            "location": "Toronto III",
            "time": " 4:15 - 5:00pm",
            "date": "April 27 2014 ",
            "speaker": "Christopher Lewis",
            "tags": "Hardware",
            "desc": "<p>Moving heavy objects is the holy grail of digital / physical installations. Get beyond blinking LEDs as Christopher (a heavy load) breaks down a rideable Kart in this introduction to digital / physical interaction. Learn how to combine Node.js + Arduino with physical components such as high-torque motors and batteries.</p>",
            "url": "http://fitc.ca/presentation/broke-ass-mario-kart-node-js-arduino/",
            "title": "Broke-Ass Mario Kart: Node.js + Arduino"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 3:00 - 3:45pm",
            "date": "April 28 2014 ",
            "speaker": "Jason Arena",
            "tags": "Web Dev, Gaming",
            "desc": "<p>Whenever Jason Arena asks other developers if they&rsquo;re embracing browsers based game development &ndash; he typically hear the same responses: performance is slow, animation looks bad, not all devices support it, and the big one &ndash; it&rsquo;s just not ready for primetime.</p><p>Jason will share some of the things we&rsquo;ve learned about browser based game development over the past two years. He will discuss misconceptions, optimization, coding environments and best practices for making robust browser based games.</p>",
            "url": "http://fitc.ca/presentation/browser-based-game-performance-im-over-my-old-flame/",
            "title": "Browser Based Game Performance: I’m Over My Old Flame"
        },
        {
            "location": "Toronto I",
            "time": " 11:00 - 11:45am",
            "date": "April 29 2014 ",
            "speaker": "Reed + Rader",
            "tags": "Inspire",
            "desc": "<p>Take a plunge into artist couple Reed + Rader&rsquo;s animated augmented reality. Reed + Rader will talk about their pioneering effort to help cement the animated GIF as a legitimate photographic editorial medium, as well as discuss their brave, nontraditional use of gaming engines to make content for the worlds of art, fashion and advertising.</p>",
            "url": "http://fitc.ca/presentation/cats-dinosaurs-and-a-lot-of-pizza/",
            "title": "Cats, Dinosaurs and A Lot of Pizza"
        },
        {
            "location": "Toronto III",
            "time": " 4:00 - 4:45pm",
            "date": "April 28 2014 ",
            "speaker": "Mary Huang",
            "tags": "Inspire, Creative Code",
            "desc": "<p>Once upon a time Mary Huang wanted to make a pretty dress. But then she learned how to code, and how electronics work, and how to build things for the internet. And with too many hours spent being fascinated with printers, ambitions become more complex.</p><p>Mary shares her work and research crossing fashion design, software and 3D printing. She will look at process behind printing shoes and building creative online tools, as well as the blurred lines between art, design, product and business.</p>",
            "url": "http://fitc.ca/presentation/cinderella-story-code-fabrication-fashion/",
            "title": "Cinderella Story: Code, Fabrication, Fashion"
        },
        {
            "location": "Toronto I",
            "time": " 5:15 - 6:00pm",
            "date": "April 27 2014 ",
            "speaker": "GMUNK",
            "tags": "Inspire",
            "desc": "<p>Come along and ride on a fantastic voyage with Munkowitz as he guides you through an hour of intense graphic stimulation. Together you will intimately unravel a design career treated as an adventure in discovery, a lesson in humility, a thirst for unwavering stimulation through reference and research, and ultimately an output spanning everything from Feature Film Holograms, Robotic Installations, Science Fiction UI and Psychedelic Prints galore. Grab your space helmet, strap it down and let&rsquo;s do this.</p>",
            "url": "http://fitc.ca/presentation/come-take-a-journey-through-time-and-space-2/",
            "title": "Come Take a Journey Through Time and Space"
        },
        {
            "location": "Toronto III",
            "time": " 2:00 - 2:45pm",
            "date": "April 28 2014 ",
            "speaker": "Andrew Casden",
            "tags": "Inspire, Creative Code",
            "desc": "<p>A short (20min) documentary with a brief discussion and Q&amp;A to follow with one of the film&rsquo;s creators, Andrew Casden.</p><p>The &lsquo;Connecting&rsquo; documentary series was born out of a strategic partnership with Microsoft and Bassett &amp; Partners, a disruptive brand&nbsp;and design strategy agency based in San Francisco. The goal of this series is to start a meaningful dialogue within the greater design&nbsp;and tech communities about the challenges and opportunities facing these disciplines. &lsquo;Connecting: Makers&rsquo; is the second chapter in&nbsp;this series, a provocative documentary that explores the impact of connectivity on design, culture and creativity &ndash; and ultimately the&nbsp;impact on humanity.&nbsp;Co-produced by Bassett &amp; Partners &amp; Microsoft Design.</p><p>The film features the following thought-leaders:</p><ul><li>Bill Buxton (Microsoft)</li><li>Bruce Nussbaum (Parsons New School of Design)</li><li>Bre Pettis&nbsp;(MakerBot)</li><li>Carla Diana (Smart Design Fellow)</li><li>Tucker Fort &amp; Gordon Hui (Smart Design)</li><li>Benedetta Piantella (NYU ITP)</li><li>Mike Glaser&nbsp;(Drexel University)</li><li>Marie O&rsquo;Mahony (Ontario College of Art &amp; Design)</li></ul>",
            "url": "http://fitc.ca/presentation/connecting-makers-screening-and-discussion/",
            "title": "Connecting: Makers. A Screening and Discussion on Design"
        },
        {
            "location": "Toronto III",
            "time": " 10:00 - 10:45am",
            "date": "April 28 2014 ",
            "speaker": "Markus Heckmann",
            "tags": "Creative Code",
            "desc": "<p>Greg and Markus will&nbsp;serve up a&nbsp;smorgasbord&nbsp;of recent bite-sized projects and treats&nbsp;that give a taste of how TouchDesigner is used&nbsp;to&nbsp;prototype ideas, develop concepts, produce effects, behaviors, interfaces and visualizations, all in TouchDesigner&rsquo;s visual interface jacked up with Python. Tie-ins will be made to notable projects from the TouchDesigner community.</p>",
            "url": "http://fitc.ca/presentation/cooking-with-touchdesigner/",
            "title": "Cooking with TouchDesigner"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 10:00 - 10:45am",
            "date": "April 29 2014 ",
            "speaker": "Anders Lassen",
            "tags": "Web Dev, Gaming",
            "desc": "<p>Uno is designed for cross-platform development of visual experiences and is the world&rsquo;s first hybrid CPU/GPU language.</p><p>In this talk Anders will share insights on how you can create slick user interfaces, apps and games, deploy to the web as well as native applications, and still get the best possible results on each platform.</p><p>Prepare for plenty of hands-on action, live coding and beautiful pixels!</p>",
            "url": "http://fitc.ca/presentation/creating-astonishing-visuals-with-uno/",
            "title": "Creating Astonishing Visuals with Uno"
        },
        {
            "location": "Toronto III",
            "time": " 11:15 - 12:00pm",
            "date": "April 27 2014 ",
            "speaker": "Tim Stutts",
            "tags": "Creative Code",
            "desc": "<p>Creative coding is a practice that is infused in everything from programming 3D-printed furniture to generative, motion graphics for a commercial&ndash;essentially any place where design and development can overlap into a singular, art-directed process. But what is its place in the interaction design (UI/UX) field within the highly requirement-driven software industry? &nbsp;Can raw programmatic exploration for the sake of ideation amount to great, usable end-products? As interaction design touches on applications with increasingly advanced, off-screen technologies, traditional deliverables such as wireframes and user-flows in themselves can distance the designer from the technology and fail to fully explore the combined potential of the human and the application. On the other extreme, a designer may choose to work directly with API&rsquo;s, but find themselves in over their head. The solution and middle ground is the creative coding platform.</p>",
            "url": "http://fitc.ca/presentation/who-works-with-creative-coders-creative-coding-in-interaction-design/",
            "title": "Creative Coding in Interaction Design"
        },
        {
            "location": "Toronto III",
            "time": " 2:00 - 2:45pm",
            "date": "April 29 2014 ",
            "speaker": "Geoffrey Lillemon",
            "tags": "Inspire, Storytelling",
            "desc": "<p>A peak into the birth, lifespan, conflict and death of storytelling through the technology and art spectrum.</p>",
            "url": "http://fitc.ca/presentation/cross-media-storytelling/",
            "title": "Cross Media Storytelling"
        },
        {
            "location": "Toronto II",
            "time": " 3:15 - 4:00pm",
            "date": "April 27 2014 ",
            "speaker": "Bermon Painter",
            "tags": "Web Dev",
            "desc": "<p>Sit in on an in-depth comparison of the top three CSS pre-processors: Stylus, Less &amp; Sass. This session is subdivided&nbsp;into beginner, intermediate and advanced topics that build on top of each other. You&rsquo;ll discover how to get each pre-processor installed, file structure concepts, features that help create CSS that&rsquo;s DRY, tips and tricks with media queries, available frameworks and how to enjoy writing CSS again.</p>",
            "url": "http://fitc.ca/presentation/css-pre-processors-sass-less-stylus-2/",
            "title": "CSS Pre-Processors: Sass, Less & Stylus"
        },
        {
            "location": "Toronto II",
            "time": " 3:00 - 3:45pm",
            "date": "April 29 2014 ",
            "speaker": "Raymond Camden",
            "tags": "Web Dev",
            "desc": "<p>A look at the various tools (both browser-based, command line, editor-based) that can help you debug your web applications. This session will also discuss how these tools can be applied to mobile web (and hybrid mobile app) development.</p><p>&nbsp;</p>",
            "url": "http://fitc.ca/presentation/debugging-your-web-stack-like-a-pro/",
            "title": "Debugging Your Web Stack Like a Pro"
        },
        {
            "location": "Toronto I, II, and III",
            "time": " 10:00 - 11:00am",
            "date": "April 27 2014 ",
            "speaker": "Stefan Sagmeister",
            "tags": "Inspire",
            "desc": "<p>Stefan Sagmeister will explore the possibilities of how to achieve happiness as a person and as designer, his tactics to make sure his work remains a calling without deteriorating into a job, as well as opportunities to design pieces that induce happiness in the audience. Lots of clips from his upcoming documentary feature &lsquo;The Happy Film&rsquo; will be shown.</p>",
            "url": "http://fitc.ca/presentation/design-and-happiness/",
            "title": "Design and Happiness"
        },
        {
            "location": "Toronto III",
            "time": " 10:00 - 10:45am",
            "date": "April 29 2014 ",
            "speaker": "Mark Argo",
            "tags": "Inspire, Creative Code",
            "desc": "<p>From museums and science centres, to workshops and digital objects &ndash; the involvement of &lsquo;play&rsquo; in interaction design helps bring audiences together to enjoy and engage. In this talk, Mark will describe how &lsquo;play&rsquo; has become a central element in Aesthetec Studio&rsquo;s work and share some of his experiences with interaction design over the past ten years.</p>",
            "url": "http://fitc.ca/presentation/designing-interactive-experiences-for-kids-of-all-ages/",
            "title": "Designing Interactive Experiences for Kids of All Ages"
        },
        {
            "location": "Toronto I",
            "time": " 4:00 - 4:45pm",
            "date": "April 29 2014 ",
            "speaker": "Kyle McDonald",
            "tags": "Inspire",
            "desc": "<p>This is an invitation to discover a mode of creative exploration where ownership, authorship and even personal identity start to collapse. What happens when your artwork is built on tools you made with friends? When you start to focus on the discussion you&rsquo;ve created instead of focusing on the tools? Then, instead of just sharing tools, what if you start to share your identity? This is a world that is fluid, where light and motion are programmable, surveillance is inverted, identities are swapped and distributed, and inspiration is everywhere.</p>",
            "url": "http://fitc.ca/presentation/do-it-with-everyone/",
            "title": "Do It with Everyone"
        },
        {
            "location": "Toronto I",
            "time": " 10:00 - 10:45am",
            "date": "April 28 2014 ",
            "speaker": "Karolina Sobecka",
            "tags": "Inspire, Creative Code",
            "desc": "<p>Technology, like magic, can create a sense of wonder by expanding our notions of what is possible or what is known. Those experiences, striking and visceral, also challenge our sense of causality &mdash; suggesting that it can operate beyond our tacit understanding of the world.</p><p>Karolina will talk about the role that spectacle and implied logic play in designing interactive installations for public space. Karolina&rsquo;s projects are situations for the viewer to enter or pass through; the viewer&rsquo;s behaviour activates a dynamic based on social or perceptual mechanisms that examines how we communicate, interact and apprehend each other and the world.</p>",
            "url": "http://fitc.ca/presentation/effects-and-causes/",
            "title": "Effects and Causes"
        },
        {
            "location": "Toronto III",
            "time": " 12:15 - 1:00pm",
            "date": "April 27 2014 ",
            "speaker": "Rami Sayar",
            "tags": "Creative Code",
            "desc": "<div title=\"Page 1\"><div><p>Can the literary arts be more than the creative output of a single individual?</p><p>Most people believe literature arises from the self-expression of individual artists, however there is potential for more innovative models of creative production. This talk will formulate new ways to conceive artistic production, based on principles of collaboration and shared knowledge. It will demonstrate how creative expression can happen between strangers. This opportunity for collective art is something technology can truly empower.</p><p>The technology developed in preparation for this talk allows us to conduct a live experiment with the attendees on collaboration with creative constraints. The results of the experiment will be viewed in real-time. The talk will also briefly delve into the technical details of the technology, although participants are not expected to have deep technical knowledge of real-time systems and cloud computing.</p><p>Let&rsquo;s create art collaboratively!</p></div></div>",
            "url": "http://fitc.ca/presentation/empowering-collaborative-art-with-technology/",
            "title": "Empowering Collaborative Art with Technology"
        },
        {
            "location": "Toronto II",
            "time": " 11:00 - 11:45am",
            "date": "April 29 2014 ",
            "speaker": "Chris Mills",
            "tags": "Web Dev",
            "desc": "<p>&ldquo;Mobile web&rdquo; applications are often criticised for having inferior performance and a limited feature set, compared to &ldquo;native&rdquo; apps. To redress the balance, browser vendors are working on a number of technologies to grant them superpowers.</p><p>In this talk, Chris Mills will discuss the inherent historic problems with mobile apps and which technologies are stepping up to fill the holes. This includes device APIs such as Web Activities, Notification, Network Information and Vibration, offline apps, installable apps and performance enhancers such as asm.js and Emscripten.</p>",
            "url": "http://fitc.ca/presentation/empowering-the-mobile-web/",
            "title": "Empowering the “Mobile Web”"
        },
        {
            "location": "Toronto II",
            "time": " 10:00 - 10:45am",
            "date": "April 29 2014 ",
            "speaker": "CJ Gammon",
            "tags": "Inspire, Web Dev",
            "desc": "<p>The Web has changed how we communicate, interact and create. The platform and how we use it are constantly adapting to support new innovations. The Web has already grown a great deal as a design surface and the future looks even brighter.</p><p>In this talk CJ Gammon will discuss the medium of the Web and its trajectory for the future. He will dive into approaches and coming features that will allow us to do great creative work on the Web.</p>",
            "url": "http://fitc.ca/presentation/exploring-the-web-as-a-graphical-medium/",
            "title": "Exploring the Web as a Graphical Medium"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 2:00 - 2:45pm",
            "date": "April 28 2014 ",
            "speaker": "Ben Unsworth",
            "tags": "Creative Code, Gaming, Hardware",
            "desc": "<p>Smuggling lasers onto airplanes, coding on yachts, bribing customs officials, negotiating with cat managers and biking through countries on the brink of war: is this a Bond movie? Deliriums of psychotic Fight Clubbers? Or just the ins and outs of an installation-based interactive agency? Find out what it takes to deliver cutting edge interactive experiences to a global marketplace&hellip; just don&rsquo;t tell anybody.</p>",
            "url": "http://fitc.ca/presentation/extreme-interactive/",
            "title": "Extreme Interactive"
        },
        {
            "location": "The B-Side Room",
            "time": " 2:00 - 2:30pm",
            "date": "April 28 2014 ",
            "speaker": "Jason Theodor",
            "tags": "Failure",
            "desc": "<p>Failure. This is not a word most of us want to hear, let alone strive for. But what good is a world of perfectionists and good-enoughs? When do you give yourself the license to play, to experiment and to make mistakes? Jason Theodor proposes that you set aside some time to fail more.</p><p>In this session, Jason will walk you through how failing on purpose can actually boost the quality of your creative output. Fail to succeed!</p>",
            "url": "http://fitc.ca/presentation/fail-moar/",
            "title": "FAIL MOAR!"
        },
        {
            "location": "Toronto II",
            "time": " 10:00 - 10:45am",
            "date": "April 28 2014 ",
            "speaker": "Frédéric Harper",
            "tags": "Web Dev",
            "desc": "<p>The mobile web got a bad reputation. In reality, it&rsquo;s the platform to bet on if you care about the reach and sustainability of your product. In this talk, Fr&eacute;d&eacute;ric Harper will show you how you can use HTML5, CSS3 and JavaScript to build amazing mobile applications to brush up what you previously published. Learn about the open web technologies, including WebAPIs, and tools designed to get you started developing HTML apps for Firefox OS and the web.</p>",
            "url": "http://fitc.ca/presentation/firefox-os-fixing-the-mobile-web/",
            "title": "Firefox OS: Fixing the Mobile Web"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 2:00 - 2:45pm",
            "date": "April 29 2014 ",
            "speaker": "Kurt Krumme",
            "tags": "Business",
            "desc": "<p>Love &lsquo;em, hate &lsquo;em or love to hate &lsquo;em, clients are the reason we all get to go to work. Surprisingly, when tough customers act like irrational, flip-flopping, bad idea factories it&rsquo;s usually because we made them that way.</p><p>Well haters gonna hate but in this 45-minute-long thrill ride Kurt Krumme will take a more positive approach. Topics include strategies on handling Scope Creep, Delays, Budget Increases, Presentations and ideas around stopping issues before they start.</p>",
            "url": "http://fitc.ca/presentation/getting-along-with-clients-2/",
            "title": "Getting Along with Clients"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 11:00 - 11:45am",
            "date": "April 28 2014 ",
            "speaker": "Chris Strom",
            "tags": "Web Dev, Gaming",
            "desc": "<p>You&rsquo;re gonna code in this talk and it&rsquo;s going to be *amazing*</p><p>This is a variation of the course that Chris Strom teaches to kids 8 years old &amp; up. It includes three different exercises designed to introduce new concepts while building on those previously learned: basic shapes and animations, building and manipulating a game player and WebGL for beautiful graphics.</p><p>Coding is all done with the same in-browser code editor used in the new book &ldquo;3D Game Programming for Kids.&rdquo; This way, everything is browser-based and there is virtually no setup work required. It uses local storage so attendees following along can keep their work. Coding feedback is immediate with the Three.js animations displaying directly in the browser.<br>So easy a kid could do it. Well some of it, at least <img alt=\":)\" src=\"http://fitc.ca/wp-includes/images/smilies/icon_smile.gif\"></p>",
            "url": "http://fitc.ca/presentation/getting-started-with-3d-game-programming-in-three-js/",
            "title": "Getting Started with 3D Game Programming in Three.js"
        },
        {
            "location": "Toronto II",
            "time": " 2:00 - 2:45pm",
            "date": "April 28 2014 ",
            "speaker": "Derek Watson",
            "tags": "Web Dev",
            "desc": "<p>This high-level introduction to Node.js gives the casual JavaScript developer everything they need to start building web applications,&nbsp;JSON APIs, network servers and more. Let&nbsp;Derek Watson, tech lead at The Working Group, veteran developer and JavaScript fanatic share key insights into this exciting new platform.</p>",
            "url": "http://fitc.ca/presentation/getting-started-with-node-js/",
            "title": "Getting Started with Node.JS"
        },
        {
            "location": "The B-Side Room",
            "time": " 3:00 - 3:30pm",
            "date": "April 28 2014 ",
            "speaker": "Stacey Mulcahy",
            "tags": "Hardware",
            "desc": "<p>Two salty dogs of the hardware and software world duke it out and ask the questions that you would never dare to ask&hellip;but always wanted to know.</p><p>You should also come to see things done to hardware that deny general good sense.</p>",
            "url": "http://fitc.ca/presentation/hardware-for-a-soft-world/",
            "title": "Hardware for a Soft World"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 5:15 - 6:00pm",
            "date": "April 27 2014 ",
            "speaker": "Harvey Moon",
            "tags": "Hardware",
            "desc": "<p>In this talk Harvey Moon will cover a brief overview of the history of collaboration between artists and machines. His talk will discuss artists and technologists through history that have advanced our connection to the medium. Harvey will cover some theory, artists, inspirations and some of his own work that has been inspired by these ideas.&nbsp;The goal of the talk is to enforce media literacy and encourage the audience to embrace the exciting creative possibilities with today&rsquo;s new technologies.</p>",
            "url": "http://fitc.ca/presentation/how-to-collaborate-with-a-machine/",
            "title": "How to Collaborate with a Machine"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 12:00 - 12:45pm",
            "date": "April 28 2014 ",
            "speaker": "Bob Heubel",
            "tags": "Gaming",
            "desc": "<p><strong>Ten things mobile game designers get wrong and how to fix them:</strong> Ever play a game that could be awesome if it were not for one little thing?&nbsp; Or worse, you play a game that causes you to verbally curse it, uninstall it and leave you wondering why millions of people play that game? &nbsp;You are not alone. Come to this session to learn the top ten mistakes mobile game designers make and best practices to help you avoid making those mistakes, all while vastly improving user experience.&nbsp; Don&rsquo;t make a game others hate.</p><p><b>Attendee takeaway</b>: Without referencing specific game titles (we don&rsquo;t want to upset anyone), attendees will learn about game design elements that detract or ruin a perfectly good gaming experience and how you can fix or improve the user experience by following some core game design best practices.</p><p><b>Intended audience:</b>&nbsp;Any mobile game developers/designers/testers</p>",
            "url": "http://fitc.ca/presentation/ihateyourgame/",
            "title": "I HATE YOUR GAME"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 12:15 - 1:00pm",
            "date": "April 27 2014 ",
            "speaker": "Edward Keeble",
            "tags": "Hardware",
            "desc": "<p>The geolocation capabilities of smartphones are fantastic and well documented, so if your project requires you to locate people outside, you&rsquo;re pretty well covered. But what do you do if you need to locate and identify participants indoors? This presentation will provide an introduction to a range of techniques for finding people within a predefined space. It will cover everything from optical tracking and WiFi monitoring to the more recently available iBeacon, and discuss how you can incorporate these techniques into your creative coding projects.</p>",
            "url": "http://fitc.ca/presentation/indoor-positioning-techniques-in-2014-where-are-they-now/",
            "title": "Indoor Positioning Techniques in 2014: Where Are They Now?"
        },
        {
            "location": "Toronto I",
            "time": " 10:00 - 10:45am",
            "date": "April 29 2014 ",
            "speaker": "Ingrid Kopp",
            "tags": "Inspire, Storytelling",
            "desc": "<p>Stories are stories but storytelling has changed. New technologies have always fundamentally changed how we see and process the world but now we are in a period of exponential change. We can connect story, technology and design together to tell different kinds of stories and reach audiences in new ways. And through social media, these audiences now have their own audiences.</p><p>This new storytelling paradigm has been described as participatory, cross-platform, immersive, transmedia and interactive. But these projects require a great deal of collaboration across industries and skill sets. What kinds of stories are possible now? And how do we collaborate across disciplines to tell them?</p>",
            "url": "http://fitc.ca/presentation/interactive-storytelling-adventures/",
            "title": "Interactive Storytelling Adventures"
        },
        {
            "location": "Toronto III",
            "time": " 5:15 - 6:00pm",
            "date": "April 27 2014 ",
            "speaker": "Vincent McCurley",
            "tags": "Inspire",
            "desc": "<ul><li>Take a behind-the-scenes look into the NFB&rsquo;s production of The Last Hunt &ndash; a multi-platform interactive photo-story experience dealing with the strength of family bonds, tradition and a cabin in the woods.</li><li>Break down the creative and technical thought processes that began with 30 beautiful photos and transformed them into a complete interactive multi-media story experience.</li><li>Learn about the challenges and benefits of working with the Adobe AIR/Flash platform, production pipelines, improving performance with GPU-acceleration and workarounds to deployment issues.</li><li>Go beyond responsive design to learn about the user-experience customizations for each of the target platforms: iPad, iPhone, Android and desktop web.</li></ul>",
            "url": "http://fitc.ca/presentation/interactive-tablet-design-making-of-the-last-hunt/",
            "title": "Interactive Tablet Design: Making of The Last Hunt"
        },
        {
            "location": "Toronto I, II, and III",
            "time": " 5:00 - 6:00pm",
            "date": "April 29 2014 ",
            "speaker": "Robert Wong",
            "tags": "Inspire",
            "desc": "<p>Design and technology have a lot in common: they are both highly creative endeavors, they both add beauty to our lives and they both make visible what, without its creator, the world might never see.</p>",
            "url": "http://fitc.ca/presentation/invent-the-future/",
            "title": "Invent the Future"
        },
        {
            "location": "Toronto II",
            "time": " 4:15 - 5:00pm",
            "date": "April 27 2014 ",
            "speaker": "Rich Gilbank",
            "tags": "Web Dev",
            "desc": "<p dir=\"ltr\">Sooner or later, we all have, or will have to join a &ldquo;completed&rdquo; project only to find jQuery soup: functions within functions nested inside AJAX callbacks. It sucks. How did our beloved front-end language bring us here? Why did we even need jQuery? Couldn&rsquo;t we just use vanilla JS?</p><p>In this session we&rsquo;ll be going over JavaScript holistically, from some of the original patches and polyfills, to present-day gotchas and quirks, and into the future looking at how the hot new HTML5 APIs and ES6 specs will change this landscape moving forward.</p>",
            "url": "http://fitc.ca/presentation/jquery-to-javascript-growing-beyond-the-dom/",
            "title": "jQuery to Javascript: Growing Beyond the DOM"
        },
        {
            "location": "Toronto I",
            "time": " 12:15 - 1:00pm",
            "date": "April 27 2014 ",
            "speaker": "Greg Borenstein",
            "tags": "Inspire",
            "desc": "<p>For more than a century, science fiction has been both the conscience and the subconscious of the technology industry. Its authors&nbsp;have invented new ideas that became world-changing technologies and they&rsquo;ve shaped the moral, philosophical and aesthetic&nbsp;lenses that we use to understand our changing world. We use an interface from Minority Report to operate our Star Trek&nbsp;communicators, in order to communicate over geostationary satellites invented by Arthur C. Clarke, to visit William Gibson&rsquo;s&nbsp;cyberspace and experience the drifting identities and psychological dislocation described by Philip K. Dick.</p><p>As a designer, technologist and artist, Greg Borenstein has mined science fiction for storytelling tools that help communicate how new&nbsp;technologies feel and what they might mean to our world. In this talk, Greg presents projects that show some of what he has learned and&nbsp;outline ideas that may come in handy in your own practice.</p>",
            "url": "http://fitc.ca/presentation/learning-from-science-fiction/",
            "title": "Learning from Science Fiction"
        },
        {
            "location": "The B-Side Room",
            "time": " 3:00 - 3:30pm",
            "date": "April 29 2014 ",
            "speaker": "Nadine Lessio",
            "tags": "Hardware",
            "desc": "<p>Thinking of doing your first installation? Wondering what to expect?&nbsp;Come hear about some of the challenges and lessons learned from pulling together a traveling 8-bit photo-booth, AKA:&nbsp;The Interstellar Selfie Station. &nbsp;Nadine Lessio will also chat about working with game peripherals, being resourceful on a shoestring and how to get started thinking and creating in a physical space.</p>",
            "url": "http://fitc.ca/presentation/lessons-learned-from-the-iss/",
            "title": "Lessons Learned from the ISS"
        },
        {
            "location": "Toronto II",
            "time": " 2:15 - 3:00pm",
            "date": "April 27 2014 ",
            "speaker": "Stacey Mulcahy",
            "tags": "Web Dev",
            "desc": "<p>Are you doing it because all the cool kids are? Then join Stacey Mulcahy to look at how the cool kids are doing it and what you can take away and implement into your workflow.</p><p>In this session, Stacey will look at some of the common issues (and misconceptions) about responsive design: different design-oriented approaches will be discussed including device agnosticism and modularity, along with common design patterns, tools and approaches.</p>",
            "url": "http://fitc.ca/presentation/making-content-shine-the-drama-of-responsive-design/",
            "title": "Making Content Shine: The Drama of Responsive Design"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 10:00 - 10:45am",
            "date": "April 28 2014 ",
            "speaker": "Chris Shankland",
            "tags": "Web Dev, Gaming",
            "desc": "<p>When developing in web languages like HTML5, CSS and JavaScript, you don&rsquo;t control the majority of the code that is running your game, therefore you need to be able to profile and understand how the underlying code functions. Chrome Tools, JSPerf and Automated Testing are all critical tools that make HTML5 development possible.</p><p>Some key technical points that Chris Shankland will dive into include:</p><ul><li>It is significantly faster to reassign functions rather than use inheritance</li><li>The importance of profiling and the need to not assume anything</li><li>How to create automated test cases</li><li>How to optimize for garbage collection environment</li><li>Technical details around CSS vs. Canvas</li><li>The need to optimize for the environment your code will ultimately be running in &ndash; specifically the browser interpreter &ndash; and not your specific development environment.</li></ul><p>And some technical challenges that will be discussed:</p><ul><li>Performance Optimization</li><li>Automated Testing</li><li>Understanding native performance and memory in a UIWebView</li><li>Using wrappers and building plug-ins for mobile app stores</li></ul>",
            "url": "http://fitc.ca/presentation/making-html-5-mobile-games-indistinguishable-from-native-apps/",
            "title": "Making HTML5 Mobile Games Indistinguishable from Native Apps"
        },
        {
            "location": "Toronto III",
            "time": " 12:00 - 12:45pm",
            "date": "April 29 2014 ",
            "speaker": "Masashi Kawamura",
            "tags": "Inspire, Creative Code",
            "desc": "<p>PARTY is a creative lab in Tokyo &amp; New York.</p><p>We do weird and fun stuff for both clients and ourselves, by mixing storytelling and technology.</p><p>We would like to share our latest work &amp; creative process of &ldquo;making new ways to make things.&rdquo;</p>",
            "url": "http://fitc.ca/presentation/making-new-ways/",
            "title": "Making New Ways to Make"
        },
        {
            "location": "Toronto II",
            "time": " 5:15 - 6:00pm",
            "date": "April 27 2014 ",
            "speaker": "Dann Toliver",
            "tags": "Web Dev",
            "desc": "<p>Ajax makes client-to-server communication a cinch. Socket.IO makes persistent two-way connections simple. What browser APIs underlie these libraries? What other communication mechanisms are available and how can they help you build incredible client-side experiences?</p><p>Dann Toliver will look at the XHR and WebSocket APIs to see how easy it is to build a working example using those APIs directly in modern browsers. (He&rsquo;ll also show how gnarly it is in antiquated browsers, which motivates our use of libraries.) Then he&rsquo;ll examine other communication APIs like SSE and WebRTC to see what they can offer us.</p><p>Along the way Dann will consider an application building style that treats all incoming messages the same; whether they originate from local events, other windows, peripherals, the server or even other clients. He&rsquo;ll also look at some of the advantages that this message passing architecture offers over systems that more tightly couple communication channels to effects.</p>",
            "url": "http://fitc.ca/presentation/message-in-a-browser/",
            "title": "Message in a Browser"
        },
        {
            "location": "Toronto I",
            "time": " 4:00 - 4:45pm",
            "date": "April 28 2014 ",
            "speaker": "Yuko Shimizu",
            "tags": "Inspire",
            "desc": "<p>We all make mistakes, Yuko Shimizu has made many. But at least she has learned from it and become a better creative professional.</p><p>Yuko sat down and made a list of the 20 most important things she learned as a creative professional, which hopefully you can use in your creative career.</p><p>&nbsp;</p>",
            "url": "http://fitc.ca/presentation/mistakes-lessons-and-being-creative/",
            "title": "Mistakes, Lessons, and Being Creative"
        },
        {
            "location": "Toronto Hilton",
            "time": " 10:00 - 5:00pm",
            "date": "April 26 2014 ",
            "speaker": "Bermon Painter",
            "tags": "Web Dev, Workshop",
            "desc": "<div><em><em>Note: This all day workshop will run from 10-5pm on Sat April 26th, and is available to WORKS and WORKSHOP ticket holders.</em></em>&nbsp;<p>Discover the benefits of using Sass, a CSS pre-processor, along with Compass to help streamline front-end development, collaborate with other developers, and overall to help you enjoy writing CSS. The workshop will be divided up into 4 sections: basic, intermediate, advanced and tools of the trade and other fun tricks. Topics covered include:</p></div><ul><li>Pre-processor basics &amp; setup</li><li>Sass vs. SCSS syntax</li><li>Basic DRY concepts with variables, nesting</li><li>Functions and operations</li><li>Expanded DRY concepts with mixins, extend, and placeholders</li><li>Media queries</li><li>Lists and new Sass 3.3 features</li><li>Structuring Sass files and directories</li><li>Using Compass</li><li>Other frameworks</li><li>Front-end performance</li><li>Questions and tinkering</li></ul><p><strong>Knowledge of CSS is highly recommended for this workshop</strong>.</p>",
            "url": "http://fitc.ca/presentation/modular-front-end-development-with-sass-compass-workshop-2/",
            "title": "Modular Front-End Development with Sass & Compass Workshop"
        },
        {
            "location": "The B-Side Room",
            "time": " 11:00 - 11:30am",
            "date": "April 28 2014 ",
            "speaker": "Neil Mendoza",
            "tags": "Hardware",
            "desc": "<p>In this session, Neil will speak about and demo the tech behind a couple of his projects and showing you how to use them in your own work. &nbsp;If you&rsquo;ve e<span>ver wondered how to play music with a motor or give your&nbsp;cellphone&nbsp;wings then this is the talk for you.</span></p>",
            "url": "http://fitc.ca/presentation/musical-machines-and-flapping-phones/",
            "title": "Musical Machines and Flapping Phones"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 3:00 - 3:45pm",
            "date": "April 29 2014 ",
            "speaker": "Kevin Airgid",
            "tags": "Business",
            "desc": "<p>In this session Kevin Airgid will use real world examples of how to improve your networking, selling and pitching skills to increase your sales numbers.</p><p>Topics will include:<br>- Networking 101: How to avoid dead ends and network with true leads<br>- Learn never to sell but to teach your clients to buy<br>- Pitching is for amateurs, why you should always have the inside track</p><p>Presented by the&nbsp;<a href=\"http://www.omdc.on.ca/\" target=\"_blank\" title=\"Ontario Media Development Corporation\">Ontario Media Development Corporation (OMDC)</a></p>",
            "url": "http://fitc.ca/presentation/networking-selling-and-pitching/",
            "title": "Networking, Selling and Pitching"
        },
        {
            "location": "The B-Side Room",
            "time": " 12:15 - 12:45pm",
            "date": "April 27 2014 ",
            "speaker": "Lanny Geffen",
            "tags": "Storytelling",
            "desc": "<p><strong>How Designers Use Storytelling to Create Infectious Ideas</strong></p><p><span>From the beginning, storytellers have been able to lead people on incredible journeys beyond the here and now. By inspiring imagination and evoking emotion, storytellers catalyze ideas and&nbsp;persuade innovation.</span></p><p><span>In this session, attendees will discover the&nbsp;art and utility of great storytelling from Martin Luther King Jr.&rsquo;s&nbsp;&ldquo;I Have A Dream&rdquo; to the great innovators disrupting Silicon Valley, and experience how storytelling can reshape the conversation and lead to new outcomes.</span></p><p><span>&nbsp;</span></p>",
            "url": "http://fitc.ca/presentation/neural-coupling-and-storytelling/",
            "title": "Neural Coupling and Storytelling"
        },
        {
            "location": "Toronto III",
            "time": " 4:00 - 4:45pm",
            "date": "April 29 2014 ",
            "speaker": "Kim Pimmel",
            "tags": "Inspire",
            "desc": "<p>Kim Pimmel is&nbsp;a bit obsessed with cinematic storytelling through new forms of analog visual effects. Whether using familiar materials in novel ways, or thinking up new techniques entirely,&nbsp;he wants the viewer to be drawn into the rich visuals, then be absorbed by the abstract narrative.</p><p>Join&nbsp;Kim as&nbsp;he shows some of&nbsp;his latest work, confesses to playing mad scientist with unhealthy chemicals, talks about happy accidents with 3D printing and shows how not to do motion control. And yeah, lots of quinoa.</p>",
            "url": "http://fitc.ca/presentation/new-forms-2/",
            "title": "New Forms"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 4:00 - 4:45pm",
            "date": "April 28 2014 ",
            "speaker": "Stephan Tanguay",
            "tags": "Creative Code, Gaming, Hardware",
            "desc": "<div dir=\"ltr\"><p>2014 is the year that virtual reality will go from a bad memory from the 90s to the beginning of a new way to experience content. Already the Oculus Rift has started to transform several industries with its ability to transport you to a completely interactive virtual space. As a designer and/or developer, this transformation will change the way you look at your work.</p><p>The first time you build something on the screen and then project yourself into your own creation, you quickly feel a sense of wonder and excitement from experiencing content in a way you never expected. You will also realize that many things that work well with a typical mouse, keyboard and computer screen work considerably different in the virtual world. Sharing these experiences with Stephan will help you to understand how to leverage what works in virtual reality and what to avoid so your virtual experiences will be effective at immersing users in your virtual creations.</p></div>",
            "url": "http://fitc.ca/presentation/oculus-rift-dos-donts-and-demos/",
            "title": "Oculus Rift : Dos, Don’ts and Demos"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 12:00 - 12:45pm",
            "date": "April 29 2014 ",
            "speaker": "Pamela Hilborn",
            "tags": "Inspire, Storytelling",
            "desc": "<p>The physical book is one of the most beloved formats in human culture. Join Pamela &ndash; a book-lover and a designer &ndash; and travel through history to understand how this format has evolved over time. &nbsp;Pamela will dig deep into the anthropology of the book, exploring our relationship to this once-sacred and rare object. She will also take a look at how new technology is helping to enhance the experience of reading as we move from analog to digital reading experiences.</p>",
            "url": "http://fitc.ca/presentation/our-once-and-now-relationship-with-the-book/",
            "title": "Our Once and Now Relationship with the Book"
        },
        {
            "location": "Toronto II",
            "time": " 4:00 - 4:45pm",
            "date": "April 29 2014 ",
            "speaker": "Matias Niemelä",
            "tags": "Web Dev",
            "desc": "<p>How much code have you thrown away in your career? Did you ever ask yourself why? What is it that makes my code too complex to maintain? How often should I refactor my code and why? How exactly do I go about doing it? What else can be done so that my code is robust and lasts for longer than before? How can I improve my skills to enhance my JavaScript code as well as my AngularJS code?</p><p>In this talk, Matias will teach you how to craft JavaScript and AngularJS code in such a way that it is easier to reuse and modify. He will teach you solid programming techniques of how to decouple, refactor and organize your code as best possible to achieve higher levels of flexibility and how to maintain code quality by crafting strong tests.</p>",
            "url": "http://fitc.ca/presentation/tba/",
            "title": "Pro Reusability and Maintainability in JavaScript with AngularJS"
        },
        {
            "location": "Toronto I",
            "time": " 12:00 - 12:45pm",
            "date": "April 28 2014 ",
            "speaker": "Sougwen Chung",
            "tags": "Inspire",
            "desc": "<p>How can established techniques in art making and composition find a new voice in the current cultural, technological and creative landscape?</p><p>Sougwen Chung shares her approach and reflects on her artistic development and forthcoming curiosities. From her origins as a violinist, to an artist working within the realm of intricate and textural audio-visuals and installation, Chung will trace her process of being inspired by tactile materials against a connection and disconnection with digital technology. In this talk,&nbsp;Sougwen will communicate an interdisciplinary perspective on culling influences and inquiry for exploring transitional edges in creative practice.</p>",
            "url": "http://fitc.ca/presentation/process-poetics-and-performance-2/",
            "title": "Process, Poetics and Performance"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 4:15 - 4:45pm",
            "date": "April 27 2014 ",
            "speaker": "Jared Ficklin",
            "tags": "Storytelling",
            "desc": "<p>Jared Ficklin has written a sequel to Prometheus: he calls it Prometheus Down.&nbsp; This will be a spoken word telling of epic proportion.&nbsp; This performance draws from, and may reveal, a philosophy of movie watching and movie making that would change the industry.&nbsp; It is not required that you have seen Prometheus but if you are into movies, sci-fi or energetic storytelling you will enjoy this.&nbsp; But if you have seen Prometheus, and particularly if you were not satisfied with it, this will change everything for you.&nbsp; So let&rsquo;s have some Sci-Fi dissecting fun!</p>",
            "url": "http://fitc.ca/presentation/prometheus-down/",
            "title": "Prometheus Down"
        },
        {
            "location": "Toronto Hilton",
            "time": " 10:00 - 5:00pm",
            "date": "April 26 2014 ",
            "speaker": "Paul Trani",
            "tags": "Workshop",
            "desc": "<p><em>Note: This all day workshop will run from 10am-5pm on Sat April 26th, and is available to WORKS and WORKSHOP ticket holders.</em></p><p>Let&rsquo;s face it: we all want to be rock stars. Whether that means being an expert in the industry, producing award-winning projects, posting amazing work to make your friends jealous, or just getting things done faster so you can go do other things. Well, consider this workshop your rock star boot camp. It will cover all the cutting edge tools and apps you need to know about how to work faster, smarter and more guitar-smashing than ever. &nbsp;Paul Trani will get you out of your comfort zone and turn you on to new apps and services of which you might not be aware, and show you some tips to longstanding apps that you might already be using:</p><ul><li>Pro Photoshop tricks for editing and creating graphics</li><li>How to create/export graphics in a fraction of the time</li><li>Illustrator tips for creating interfaces</li><li>How to post work, collaborate and share files with others</li><li>Animate and add interactivity using Edge Animate</li><li>Create for the responsive web using Edge Reflow</li><li>What Muse is and why you should care</li><li>Easy 3D printing from Photoshop</li><li>Video apps and techniques</li><li>Pro tips for both designers and developers</li></ul><p>This workshop will stretch your skill set and turn you on to new tools and techniques &ndash; who knows where this will all lead! All we know is that it will be a wildly fun ride. <img alt=\":)\" src=\"http://fitc.ca/wp-includes/images/smilies/icon_smile.gif\"></p>",
            "url": "http://fitc.ca/presentation/rock-star-results-using-creative-cloud-workshop/",
            "title": "Rock Star Results Using Creative Cloud Workshop"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 4:00 - 4:45pm",
            "date": "April 29 2014 ",
            "speaker": "Dave Benton",
            "tags": "Business, Storytelling",
            "desc": "<p>In this session, Dave Benton will discuss his strategy to effectively convey a brand online. &nbsp;Constructing a plot, defining your brand anchor and refining your message will be the focus of this talk. &nbsp;Leveraging real world examples, you will receive the tools to effectively tell your own brand stories. &nbsp;Go behind the scenes and see how Webby awarded brand experiences were created.</p>",
            "url": "http://fitc.ca/presentation/showing-your-brand-story-online/",
            "title": "Showing Your Brand Story Online"
        },
        {
            "location": "Toronto III",
            "time": " 11:00 - 11:45am",
            "date": "April 28 2014 ",
            "speaker": "Adam Carlucci",
            "tags": "Creative Code",
            "desc": "<p>Crafting an interactive experience can often be an exercise in taming imprecise meatspace inputs like cameras, microphones and finicky hardware. The communities surrounding toolkits like openFrameworks, Processing, Cinder, PureData, etc have contributed a wealth of useful pre-built components for managing this complexity, but it is rare that one finds a component which happens to be an exact match for the problem at hand. The process of customizing something like a camera vision or audio analysis component to your installation&rsquo;s needs often results in a deep dive into the DSP wing of Wikipedia, where dense phrases like &ldquo;normalized cross-power spectrum&rdquo; and &ldquo;complex exponential multiplied by a Gaussian window&rdquo; are the name of the game.</p><p>This talk will focus on a bag of DSP tricks and techniques relevant for creative coders in the form of case studies and concrete examples. In particular, there will be an emphasis on explaining how existing DSP components can be configured and chained together to form the backbone of powerful interactive installations.</p>",
            "url": "http://fitc.ca/presentation/signal-processing-magic-tricks-for-interactive-installations/",
            "title": "Signal Processing Magic Tricks for Interactive Installations"
        },
        {
            "location": "The B-Side Room",
            "time": " 4:00 - 4:30pm",
            "date": "April 29 2014 ",
            "speaker": "James White",
            "tags": "Failure",
            "desc": "<p>Sometimes the sword finds a weakness in our armour; we lose some blood and maybe stumble a bit, but always grit our teeth and get back on our feet.</p><p>James White of the Signalnoise Studio takes us through some spectacular mishaps, failures and downright crummy stuff that he&rsquo;s experienced during his 16 years as a graphic designer. Warning: possible tears.</p>",
            "url": "http://fitc.ca/presentation/bulletproof/",
            "title": "Signalnoise: Unplugged in TO"
        },
        {
            "location": "Toronto I",
            "time": " 2:00 - 2:45pm",
            "date": "April 28 2014 ",
            "speaker": "Brock Enright",
            "tags": "Inspire",
            "desc": "<p>Blurring the lines between reality and fiction, spectator and performer, Brock Enright&rsquo;s Videogame Adventure Services (V.A.S.) offers the unique experience of &nbsp;designer kidnappings for those brave enough to sign up. A pleasurable paranoia familiar from movies like &ldquo;The Game,&rdquo; &ldquo;The Matrix&rdquo; or &ldquo;Inception,&rdquo; which titillate us with the idea that life is an artificial construct controlled by an unseen force. In this interview&nbsp;Dre Labr&eacute; will peel back the layers of&nbsp;Enright&rsquo;s process to take a peek inside this original art form.</p>",
            "url": "http://fitc.ca/presentation/some-people-pay-to-be-kidnapped-v-a-s-will-do-it/",
            "title": "Some People Pay to be Kidnapped: V.A.S. Will Do It."
        },
        {
            "location": "Toronto III",
            "time": " 4:15 - 5:00pm",
            "date": "April 27 2014 ",
            "speaker": "Molly Schwartz",
            "tags": "Creative Code, Storytelling",
            "desc": "<p>Molly Schwartz&rsquo;s projects come from a need to see something, a place built, a world made, in very specific colors. Each component of a project can be seen as a characteristic feature of a submarine. This metaphor is handy at the level of undertaking and execution, categorically arranging ideas and concepts to design a story.</p><p>The exercise is to break down the elements of submersible craft and use them to develop and amplify a project. Framework / Structure / Infrastructure = Drawing. Every project starts from drawing. How is the ship built? Sketch the parts. Draw the plan. Engine = Concept. Here is the heart of your project. Sea-worthiness = Does it sink, float or take on water? Bridge = Control. How do you control everything? What operations are automated and which are manual?</p><p>Building out from simple drawings, her projects incorporate painting, objects, photography, physical and digital animation, coding, sculpture and physical computing. All elements are combined into a working system, whether physical installation, projection or animation on screen.</p><p>Molly is a painter, in love with the mechanism of invented traveling vessels and she would like to discuss making what you want to see, via the parallel idea of a submarine.</p>",
            "url": "http://fitc.ca/presentation/building-interactive-installations-is-like-walking-through-a-starship/",
            "title": "Sorting, Submarines and Stories"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 11:15 - 12:00pm",
            "date": "April 27 2014 ",
            "speaker": "Eugene Andruszczenko",
            "tags": "Hardware",
            "desc": "<p>Sparky Jr. is a programmable RGB LED mod companion light-up activation controller for arcade pushbuttons. 2 parts software, 1 part hardware, the Sparky Jr. is a unique interface and an extendable platform with a unique combination of Arduino, Processing and RGB LEDs.</p><p>Eugene Andruszczenko (32teeth) walks us through the ideation, creation and realization of leveraging OpenSource Hardware and Software through to product development.</p><p>GitHub: http://32teeth.github.io/SparkyJr/</p>",
            "url": "http://fitc.ca/presentation/sparkyjr-programmable-rgb-led-hid/",
            "title": "Sparky Jr. (Programmable RGB LED HID)"
        },
        {
            "location": "Toronto II",
            "time": " 11:00 - 11:45am",
            "date": "April 28 2014 ",
            "speaker": "Jeff Tapper",
            "tags": "Web Dev",
            "desc": "<p>For years, browser plugins have been the primary mechanism for playing streaming content over the web.&nbsp; However, plugins like Flash and Silverlight are rapidly losing their install base these days as we move to a post-plugin world.&nbsp; How can we continue to stream our content, when we can&rsquo;t rely on the plugin model?</p><p>In this session Jeff Tapper will explore the options available for plugin-less video on the web, including progressive download, Media Source Extensions and WebRTP, and share his &nbsp;thoughts on where the streaming industry is going.</p>",
            "url": "http://fitc.ca/presentation/streaming/",
            "title": "Streaming Video Without Plugins: the Future of Online Media"
        },
        {
            "location": "Toronto I",
            "time": " 3:00 - 3:45pm",
            "date": "April 29 2014 ",
            "speaker": "Andy Gilmore",
            "tags": "Inspire",
            "desc": "<p>Andy Gilmore will be discussing his creative process, which developed through a synthesis of technique and intuition and was informed by observing and experimenting with the principles and proportions that govern the perception of sound, light, line and form.</p>",
            "url": "http://fitc.ca/presentation/technical-intuition/",
            "title": "Technical Intuition"
        },
        {
            "location": "Toronto II",
            "time": " 12:00 - 12:45pm",
            "date": "April 28 2014 ",
            "speaker": "Thibault Imbert",
            "tags": "Inspire, Web Dev",
            "desc": "<p>Technology is fascinating, but should this be what drives us? What are the things you can do to differentiate yourself today? With all that noise, what are things you should be looking at?</p><p>In this talk, Thibault Imbert will look at the different technologies available today to build amazing experiences and what&rsquo;s coming tomorrow. He will focus on the importance of learning, crafting and getting out of your comfort zone and most importantly, to never be religious about a technology.</p>",
            "url": "http://fitc.ca/presentation/technology-a-means-to-an-end/",
            "title": "Technology: A Means to an End"
        },
        {
            "location": "The B-Side Room",
            "time": " 11:00 - 11:30am",
            "date": "April 29 2014 ",
            "speaker": "Sean Ramsay",
            "tags": "Hardware",
            "desc": "<p>You may be familiar with Google StreetView, but you may not know that 360&ordm; technology is about to explode. With the ability for anyone to soon leverage new immersive products (like the Bublcam and Oculus Rift), all-new immersive experiences are being created that will change the way we see and explore the world.</p><p>In this session, you will get a firsthand look at how this technology is evolving our world and how it can be leveraged to build new applications that, before today, never could have existed.</p>",
            "url": "http://fitc.ca/presentation/the-360o-technology-revolution/",
            "title": "The 360º Technology Revolution"
        },
        {
            "location": "Carmichael/Jackson",
            "time": " 3:15 - 4:00pm",
            "date": "April 27 2014 ",
            "speaker": "Tim Cannon",
            "tags": "Inspire, Hardware",
            "desc": "<p><strong>The New Anatomy: The Importance of Open Source in the Age of Human Augmentation</strong></p><p>We look towards the future with hope that technology will allow us to live more healthy and fulfilling lives. Augmented eyes will allow us to paint canvases in colors never seen by human eyes. Enhanced hearing will allow us to hear music in a way our ancestors never could have imagined.</p><p>Yet, the promise of human augmentation technology is shadowed by its potential use to needlessly divide society. While we cannot prevent all malicious use of human augmentation technology, we can work to provide open source, ethical and affordable devices.</p>",
            "url": "http://fitc.ca/presentation/the-age-of-human-augmentation/",
            "title": "The Age of Human Augmentation"
        },
        {
            "location": "Toronto I",
            "time": " 4:15 - 5:00pm",
            "date": "April 27 2014 ",
            "speaker": "Jason White",
            "tags": "Inspire, Creative Code",
            "desc": "<p>Leviathan Executive Creative Director, Jason White, reveals his studio&rsquo;s unique formula for creating new transformative visual experiences and explores the challenges that inevitably arise during the creative and production processes, from inception through to the final live experience.</p><p>From concept drawings to the creation of broadcast campaigns and experiential events, Jason takes a deeper look into the fascinating array of disciplines that Leviathan harnesses to bring projects to fruition.</p><p>Jason will also discuss Leviathan&rsquo;s recent collaborative experience with Amon Tobin&rsquo;s animated projection mapped concert visuals, building concepts for interactive, experience-based events for Hewlett Packard and Ubisoft&rsquo;s Splinter Cell Blacklist, as well as innovative approaches to forming future visual experiences.</p>",
            "url": "http://fitc.ca/presentation/the-future-of-experiential-media-and-projection-mapping/",
            "title": "The Future of Experiential Media and Projection Mapping"
        },
        {
            "location": "The B-Side Room",
            "time": " 5:15 - 5:45pm",
            "date": "April 27 2014 ",
            "speaker": "Helen Papagiannis",
            "tags": "Storytelling, Hardware",
            "desc": "<p>Augmented Reality (AR) is quickly advancing into a new phase of contextually rich personalized experiences and steering away from gimmickry. Working with AR as a PhD researcher and designer for the past decade, Helen Papagiannis has observed two different waves: the first wave of AR focused on AR as &ldquo;overlay&rdquo;, wile the second wave moving towards AR as an &ldquo;entryway&rdquo;.</p><p>The second wave of AR will surpass novelty and extend our human capacities to better understand, engage with, and experience our world in new and meaningful ways. Our devices will be highly cognizant of our constantly changing environments, delivering personalized solutions with highly relevant content and experiences. It is adaptive, working quietly in the background, and presenting itself when necessary with the user forever at the center. It works for you, and you alone. It knows you very well, your behaviours, your likes, dislikes and vital statistics. The second wave of AR combines elements like Artificial Intelligence (A.I.), machine learning, sensors, wearables and big data all to tell the unique story of you.</p>",
            "url": "http://fitc.ca/presentation/the-future-of-storytelling-and-augmented-reality-its-all-about-you/",
            "title": "The Future of Storytelling and Augmented Reality: It’s All About YOU."
        },
        {
            "location": "Toronto I",
            "time": " 12:00 - 12:45pm",
            "date": "April 29 2014 ",
            "speaker": "Grant Skinner",
            "tags": "Web Dev",
            "desc": "<p>The right tool can boost productivity and improve quality; a whole toolbox can completely revolutionize your workflow! Join Grant Skinner, technical director of gskinner, inc., to learn about the tools his team uses to reliably deliver cutting-edge web projects for savvy clients like Microsoft, Google and Mozilla. Topics will range from debugging and performance to coding, source control, automation and deployment. A great introduction for beginner &amp; intermediate devs, with some hidden gems for more advanced attendees.</p>",
            "url": "http://fitc.ca/presentation/the-javascripters-toolbox/",
            "title": "The JavaScripter’s Toolbox"
        },
        {
            "location": "Toronto I",
            "time": " 11:00 - 11:45am",
            "date": "April 28 2014 ",
            "speaker": "James White",
            "tags": "Inspire",
            "desc": "<p>We&rsquo;re creative people not because it&rsquo;s easy&hellip; but because it&rsquo;s hard.</p><p>James White, the one-man wrecking crew behind the Signalnoise Studio, takes you through some of the more turbulent and confusing times in his career as a designer. For all the successes, we each have numerous low points which can affect output, perception, stability and mood. This isn&rsquo;t a celebration of failure, but more of a close look into the life of a designer as he searches for his creative voice in pursuit of doing the work he truly loves.</p><p>James will share his 10-year journey as a young designer, the frustrations of finding a creative voice, the pitfalls of &ldquo;going viral&rdquo; and how every experience makes us a little stronger&hellip; and we can scream a little louder.</p>",
            "url": "http://fitc.ca/presentation/the-journey-not-the-destination/",
            "title": "The Journey, Not the Destination"
        },
        {
            "location": "The B-Side Room",
            "time": " 11:15 - 11:45am",
            "date": "April 27 2014 ",
            "speaker": "Graham Rapsey",
            "tags": "Storytelling",
            "desc": "<p>Coke killed their corporate website in favour of an editorial channel because they know that their business doesn&rsquo;t start with their brand, it starts with their customers. As marketers, we can use narrative, creativity and technology to define a new language for advertising. Graham Rapsey will explore this combination and why starting with people&mdash;not products&mdash;is the best strategy for telling successful stories that help people do more than simply buy your shit.</p>",
            "url": "http://fitc.ca/presentation/the-language-of-people-giving-a-shit/",
            "title": "The Language of People Giving a Shit"
        },
        {
            "location": "Toronto II",
            "time": " 11:15 - 12:00pm",
            "date": "April 27 2014 ",
            "speaker": "Sarah Hunt",
            "tags": "Web Dev",
            "desc": "<p>HTML is a powerful platform for weaving a story of data through interactivity and motion. What could otherwise be dry, stale, or rather boring information suddenly becomes vibrant, engaging and entertaining. Interactive infographics make it possible for you to truly capture your audience and engage with them in a manner that simply is not possible when merely citing dry facts or statistics. HTML gives you an entirely new medium for presenting the story of your data.</p><p>The web isn&rsquo;t static; your data shouldn&rsquo;t be either.</p><p>This session will cover the value of creating animated, interactive infographics with HTML that your readers care about using Adobe Edge Animate. Sarah Hunt will show some real-world examples of web-based infographic design and walk through some steps to get you started with your own infographics using Animate.</p>",
            "url": "http://fitc.ca/presentation/the-onions-of-interactive-infographic-design/",
            "title": "The Onions of Interactive Infographic Design"
        },
        {
            "location": "Toronto I, II, and III",
            "time": " 5:00 - 6:00pm",
            "date": "April 28 2014 ",
            "speaker": "Jared Ficklin",
            "tags": "Inspire",
            "desc": "<p><strong>Design for the next pattern of computing</strong></p><p>After 30-some-odd years, the smartphone has become the peak operating efficiency of the personal pattern of computing, but in many ways, it still falls short. Yet that tiny little device offers us a way to live a digital lifestyle &ndash; and even if it is a little awkward when it testifies against us in court, we immerse ourselves into these experiences constantly. Our desire to live in two worlds means we take our small computer devices everywhere, and this has set the stage for the next pattern of computing.</p><p>In this session, Jared Ficklin will look to the future to show a vision for the next pattern of computing and discuss how the coming changes will create a new class of products and how they are already impacting the way we design. The session will show work, and ways to work, when facing the challenge of a unique interaction model or digital experience. As this was a topic of the many interactive installations completed for last year&rsquo;s frog party, there will be many examples from work done both for clients and for fun.</p>",
            "url": "http://fitc.ca/presentation/the-other-singularity/",
            "title": "The Other Singularity"
        },
        {
            "location": "Toronto I",
            "time": " 2:00 - 2:45pm",
            "date": "April 29 2014 ",
            "speaker": "Hal Lasko",
            "tags": "Inspire",
            "desc": "<p>Join an intimate &lsquo;fireside chat&rsquo; with Hal Lasko, better known as Grandpa, for a discussion of the nature of art, technology and the freedom of limitations. What does it mean to be born in 1916 and become Internet famous? How do analogue skills relate to their digital counterparts? What is it like to be almost blind and still make art? And what gets him up every morning to put in 10 hours a day painting pixels?</p><p>Prepare to be inspired.</p>",
            "url": "http://fitc.ca/presentation/the-pixel-painter-an-interview-with-98-year-old-digital-artist-hal-lasko/",
            "title": "The Pixel Painter: An Interview With 98-Year-Old Digital Artist, Hal Lasko"
        },
        {
            "location": "The B-Side Room",
            "time": " 2:00 - 2:30pm",
            "date": "April 29 2014 ",
            "speaker": "Stefan Sagmeister",
            "tags": "Storytelling",
            "desc": "<p>Stefan Sagmeister tells stories.</p>",
            "url": "http://fitc.ca/presentation/things-that-happened/",
            "title": "Things that Happened"
        },
        {
            "location": "Toronto II",
            "time": " 12:00 - 12:45pm",
            "date": "April 29 2014 ",
            "speaker": "Christopher Bahry",
            "tags": "Inspire, Storytelling",
            "desc": "<p>Tendril is a small studio with BIG ideas. This talk will be an in-depth look at the intimate, inner-workings of their creative process, from initial story, character and visual development, through the pitch process and into production. In particular, the primary focus will be on how Tendril takes a team-based approach to building story ideas and concepts for commercial clients. There will also be an emphasis on their approach to pitching and also some of their self-initiated passion projects.</p>",
            "url": "http://fitc.ca/presentation/tiny-worlds-the-process-of-building-very-very-short-stories/",
            "title": "Tiny Worlds : The Process of Building Very, Very Short Stories"
        },
        {
            "location": "Toronto III",
            "time": " 11:00 - 11:45am",
            "date": "April 29 2014 ",
            "speaker": "Marco Petkovski",
            "tags": "Creative Code",
            "desc": "<p>Data tells us &ldquo;what&rdquo; and interactions tell us &ldquo;why&rdquo;. The classic approach to analytics is to simply observe the data and report the insights, but as analytics becomes a more engrained part of the creative process it also becomes more important to make sense of things that cannot be measured with numbers. Session recording and other tactile tools represent a brave new world for analytics and are challenging us to transcend data and connect designers and developers to user behaviour as it happens.</p>",
            "url": "http://fitc.ca/presentation/transcending-data/",
            "title": "Transcending Data"
        },
        {
            "location": "Toronto III",
            "time": " 12:00 - 12:45pm",
            "date": "April 28 2014 ",
            "speaker": "Tim Stutts",
            "tags": "Creative Code",
            "desc": "<p>There are many great tutorials on getting started with Unity, but few that approach it from the perspective of transitioning from a creative coding platform like Processing, openFrameworks and Cinder. For those making the transition, it&rsquo;s often less a question of learning the typical Unity workflow of importing 3D models and applying game logic and physics to them, and more about gaining lower level access to procedural geometry, meshes and individual vertices, etc. With a little persistence it is possible to learn how to take advantage of Unity&rsquo;s powerful visual environment coupled with C# development in MonoDevelop, and add new dimensions to the creative coding process.</p>",
            "url": "http://fitc.ca/presentation/transitioning-to-unity/",
            "title": "Transitioning to Unity"
        },
        {
            "location": "Toronto III",
            "time": " 3:00 - 3:45pm",
            "date": "April 29 2014 ",
            "speaker": "Rachel Binx",
            "tags": "Creative Code",
            "desc": "<p>As we spend more of our time online, our actions and interactions become more and more entwined with digital data. But this data is as fickle as the servers that host it, and beholden to the companies that store it. How can we preserve the data that we generate? How do we form memories from our experiences online? One solution is to pull it out of the digital realm and into the physical, in the form of custom, generated objects.</p><p>In this talk, Rachel Binx will explore the myriad forms of personal data inputs and manufacturing outputs available to us today. She will share insights from her two companies, Gifpop and Meshu, and explore what it means to create physical objects from our digital data.</p>",
            "url": "http://fitc.ca/presentation/turning-bits-into-atoms/",
            "title": "Turning Bits Into Atoms"
        },
        {
            "location": "The B-Side Room",
            "time": " 2:15 - 2:45pm",
            "date": "April 27 2014 ",
            "speaker": "Alex McLeod",
            "tags": "Storytelling",
            "desc": "<p>If a picture speaks a thousand words, then storytelling through art should be relatively straightforward.</p><p>But how do you present a story, when there really isn&rsquo;t one to tell?</p>",
            "url": "http://fitc.ca/presentation/untold-stories-storytelling-without-the-constraints-of-specificity/",
            "title": "Untold Stories // Storytelling Without the Constraints of Specificity"
        },
        {
            "location": "The B-Side Room",
            "time": " 12:00 - 12:30pm",
            "date": "April 28 2014 ",
            "speaker": "Sophi Kravitz",
            "tags": "Hardware",
            "desc": "<p>For the past 3 years Sophi Kravitz has been developing interactive projects with heartbeats and brainwaves.</p><p>In this session, she will discuss the process around bringing people into the biofeedback space and how to create an interesting experience.&nbsp;This process includes making this kind of art interactive for both participant and viewer, using infallible sensors and designing the experience so that the participant inherently knows what part of their body is causing the effect.</p>",
            "url": "http://fitc.ca/presentation/using-bio-sensors-to-make-interactive-art/",
            "title": "Using Bio-Sensors To Make Interactive Art"
        },
        {
            "location": "Toronto III",
            "time": " 3:15 - 4:00pm",
            "date": "April 27 2014 ",
            "speaker": "Marc-André Baril",
            "tags": "Inspire, Creative Code",
            "desc": "<p>How can technology and interactivity help bring people together in public spaces?</p><p>In an era of individualism enhanced by technology, where people communicate on virtual networks more than ever, Moment Factory sees an opportunity to bring people back into public spaces using the very technologies that draw them apart. The Montreal-based new media and entertainment studio brings together more than 100 artists &ndash; a mix of architects, engineers and designers from around the world &ndash; who use their talents towards a common goal: creating human-scale interactions in public spaces with the help of technology.</p><p>Meet Marc-Andr&eacute; Baril and Philippe Dubost who will share their personal experiences in the R&amp;D and interactive content teams at Moment Factory. They will provide a guided tour of some of the studio&rsquo;s key interactive productions with behind-the-scenes footage, a selection of recent prototypes and a peek into their evolving technological toolbox (X-Agora, Touch Designer, Unity3D, etc.).</p>",
            "url": "http://fitc.ca/presentation/we-do-it-in-public/",
            "title": "We Do It In Public"
        },
        {
            "location": "Toronto II",
            "time": " 4:00 - 4:45pm",
            "date": "April 28 2014 ",
            "speaker": "Addy Osmani",
            "tags": "Web Dev",
            "desc": "<p>This year web development gets a whole lot better thanks to the incredible power of Web Components. In this talk, we&rsquo;ll use polyfills to help you realize tomorrow&rsquo;s web platform today. Learn how to build your own custom tags with true encapsulation that are easily shareable and even extend native browser tags.</p><p>We&rsquo;ll talk about shadow DOM, custom elements, declarative data/event binding, touch input, smooth animations, and how you can combine them to create awesome apps. Write less boilerplate, target every platform, and be more productive by using the next generation of the web platform.</p>",
            "url": "http://fitc.ca/presentation/web-components-can-do-that/",
            "title": "Web Components Can Do That?!"
        },
        {
            "location": "Toronto II",
            "time": " 2:00 - 2:45pm",
            "date": "April 29 2014 ",
            "speaker": "Chris Strom",
            "tags": "Web Dev",
            "desc": "<p>Google&rsquo;s new language for writing web applications has reached the magical 1.0 and is well on its way to being standardized by ECMA, the same folks that maintain the JavaScript standard. It is being used today for production applications.</p><p>In this talk, Chris Strom will provide a quick introduction to a beautiful language and will convince you that you too should write your next application for the modern web using Dart.</p>",
            "url": "http://fitc.ca/presentation/why-your-next-application-should-be-written-in-dart/",
            "title": "Why Your Next Application Should Be Written in Dart"
        },
        {
            "location": "Toronto I",
            "time": " 11:15 - 12:00pm",
            "date": "April 27 2014 ",
            "speaker": "Walter, Patrick and Matt",
            "tags": "Inspire",
            "desc": "<p>Walter, Patrick and Matt are the co-creators of &ldquo;Noah&rdquo;, &nbsp;the film that won Best Short Film at the TIFF 2013 and racked up over 1.5 million views when the video was released in partnership with YouTube. They met at Ryerson University during a talent show where they played a cover of Sir-Mix-A-Lot&rsquo;s &ldquo;Baby Got Back&rdquo;. They create stories, songs and memories together.</p><p>In the new democratic age of the internet, consumers and creators care less about the value of money and more about the value of people.</p>",
            "url": "http://fitc.ca/presentation/you-dont-need-money/",
            "title": "You Don’t Need Money"
        },
        {
            "location": "Toronto III",
            "time": " 3:00 - 3:45pm",
            "date": "April 28 2014 ",
            "speaker": "Lauren McCarthy",
            "tags": "Inspire, Creative Code",
            "desc": "<p>Can we use technology to help us be more human? To smile more, to touch and to listen to each other? What if a computer could understand and make decisions about our social relationships better than we could ourselves? Would our interactions be improved by computationally determining what to do and say? What happens if we crowdsource our dating lives and actually find love? Lauren McCarthy describes her attempts to understand these questions&nbsp;through an artistic practice involving hacking, design and self-experimentation.</p>",
            "url": "http://fitc.ca/presentation/you-me-and-my-computer-2/",
            "title": "You, Me and My Computer"
        }
    ]
}